[
	{
		"name": "PostNord - Retail Portal",
		"description": "Full stack lead engineer developing and maintaining the Retail Portal, enabling back office functionalities for Service points, area managers and PostNord business support. Migrated functionalities from legacy rich client system to web application. Improved deployment process of Vue.js and serverless applications and migrated repository and CI/CD pipeline from Bitbucket to GitHub.",
		"imageFolder": "PostNord",
		"type": [
			{
				"name": "Web App",
				"icon": "application"
			}
		],
		"techStack": "Vue.js, Node.js, Serverless, PostgreSQL, AWS, GitHub Actions"
	},
	{
		"name": "Klarna - In-store Applications",
		"description": "Full stack lead engineer developing, maintaining and scaling In-store applications and APIs. Led performance testing for In-store applications and checked for peak readiness. Enhanced system architecture to improve performance and scalability for enterprise-level payment solutions.",
		"imageFolder": "Klarna",
		"type": [
			{
				"name": "Mobile App",
				"icon": "mobile-phone"
			},
			{
				"name": "Web App",
				"icon": "application"
			}
		],
		"techStack": "React Native, React.js, Next.js, Node.js, Express.js, Nest.js, GraphQL, PostgreSQL, MongoDB, AWS, Kubernetes, Jenkins"
	},
	{
		"name": "Ministry of Education Singapore - Appointment Booking SaaS",
		"description": "As Technical Lead at 6DegreesIT, architected and led the development of a SaaS-based appointment booking application for the Ministry of Education, Singapore. Diversified the company's technology stack from PHP to modern JavaScript frameworks and mentored technology teams implementing best practices.",
		"imageFolder": "MOE-Singapore",
		"type": [
			{
				"name": "Web App",
				"icon": "application"
			},
			{
				"name": "Mobile App",
				"icon": "mobile-phone"
			}
		],
		"techStack": "React Native, React.js, Node.js, Express.js, PostgreSQL, AWS, CloudFormation"
	},
	{
		"name": "USAID Forest-PLUS - Community-Based Micro-planning",
		"description": "As Technical Lead at Iora Ecological Solutions, developed a Community-Based Micro-planning application under the USAID-funded Forest-PLUS program. Collaborated with the University of Michigan for a Forest inventory application focused on environmental conservation and ecological data management.",
		"imageFolder": "Forest-PLUS",
		"type": [
			{
				"name": "Web App",
				"icon": "application"
			},
			{
				"name": "Mobile App",
				"icon": "mobile-phone"
			}
		],
		"techStack": "Android, Angular, Node.js, Express.js, PostgreSQL, AWS"
	},
	{
		"name": "Allianz Germany - GEP Insurance Platform",
		"description": "As Senior Software Engineer at Accenture, supported Allianz Germany's GEP project, customizing the ABS platform. Developed and enhanced UI and backend functionality for insurance systems, working on complex enterprise insurance solutions in Munich and Pune.",
		"imageFolder": "Allianz",
		"type": [
			{
				"name": "Web App",
				"icon": "application"
			}
		],
		"techStack": "Java, JSP, Spring, Oracle, On-premise"
	},
	{
		"name": "Stashfin",
		"description": "StashFin app allows users to enter a few pieces of information, pick a personal loan that fits individual's budget, and see their progress with the same every month.",
		"imageFolder": "Stashfin",
		"type": [
			{
				"name": "Mobile App",
				"icon": "mobile-phone"
			},
			{
				"name": "Web App",
				"icon": "application"
			}
		],
		"techStack": "Android, iOS, React.js, CodeIgniter, MySQL, AWS Elastic Beanstalk, S3"
	},
	{
		"name": "Janab",
		"description": "Janab is a personal assistance mobile application for lawyers, which help lawyers to organize their court cases, clients, matters, meetings and billings.",
		"imageFolder": "Janab",
		"type": [
			{
				"name": "Mobile App",
				"icon": "mobile-phone"
			}
		],
		"techStack": "Ionic2, Firebase BaaS, Firebase Realtime Database, Google Cloud Platform"
	},
	{
		"name": "Joye",
		"description": "Joye is a AI bot which connects with people to enhance their mood. If someone is happy, they can share their happiness with the world or if someone is stressed, they can use stress buster application like colouring app, meditation etc.",
		"imageFolder": "Njoy",
		"type": [
			{
				"name": "Mobile App",
				"icon": "mobile-phone"
			},
			{
				"name": "Web App",
				"icon": "application"
			}
		],
		"techStack": "iOS, DialogFlow (NLP), Angular, Firebase Realtime Database, Google Cloud Platform"
	},
	{
		"name": "FBM",
		"description": "FBM mobile app helps to manage, automate and track the sales & distribution supply chain for all types of Food/ FMCG and their post-production system including orders, inventory, sales, financials, CRM, augmentation of intelligent MIS reports, logistics, claims and real time tracking of their sales force personnel.",
		"imageFolder": "FBM",
		"type": [
			{
				"name": "Mobile App",
				"icon": "mobile-phone"
			},
			{
				"name": "Web App",
				"icon": "application"
			}
		],
		"techStack": "Android, Angular, Node.js, Express.js, MySQL, Microservices on AWS ECS"
	},
	{
		"name": "BrainyFied",
		"description": "BrainyFied is a platform for people in software industry to ask real life problems, learn best practices from IT experts, strategies from business leaders & latest technology.",
		"imageFolder": "Brainyfied",
		"type": [
			{
				"name": "Web App",
				"icon": "application"
			}
		],
		"techStack": "React.js, Node.js, Express.js, Postgres, Mongo, AWS EC2"
	},
	{
		"name": "FranchiseSoft",
		"description": "FranchiseSoft is a franchise management enterprise software to help Franchise & their Franchisees increase sales, reach higher customer and franchisee satisfaction levels, with full reporting and visibility for Franchisor and Franchisee management.",
		"imageFolder": "FranchiseSoft",
		"type": [
			{
				"name": "Mobile App",
				"icon": "mobile-phone"
			},
			{
				"name": "Web App",
				"icon": "application"
			}
		],
		"techStack": "Android, iOS, React.js, Node.js, Express.js, MySQL, Google Datastore, AWS Elastic Beanstalk"
	},
	{
		"name": "Ezee Salon",
		"description": "Ezee Salon app allows users to buy & redeem deals, browse & book nearby salons, book a beautician to provide home service.",
		"imageFolder": "Ezee",
		"type": [
			{
				"name": "Mobile App",
				"icon": "mobile-phone"
			},
			{
				"name": "Web App",
				"icon": "application"
			}
		],
		"techStack": "Android, iOS, Angular 6, Node.js, Express.js, Postgres, AWS Elastic Beanstalk"
	},
	{
		"name": "Pillion",
		"description": "Pillion is a two-wheeler electric taxi service which helps city commuters to avail the advantage of switching over to zero polluting Electric Mobility. Pillion helps commuters to reach last mile destinations from any public point, such as a metro station or a busy bus terminal.",
		"imageFolder": "Pillion",
		"type": [
			{
				"name": "Mobile App",
				"icon": "mobile-phone"
			},
			{
				"name": "Web App",
				"icon": "application"
			}
		],
		"techStack": "Android, Bootstrap, Laravel, MySQL, AWS Elastic Beanstalk"
	},
	{
		"name": "Titan HST",
		"description": "Titan HST is a comprehensive emergency alert system & mass notifications system, suitable for businesses, governments and schools. It allows administrators, organizational users and emergency personnel to communicate emergency information.",
		"imageFolder": "TitanHST",
		"type": [
			{
				"name": "Mobile App",
				"icon": "mobile-phone"
			}
		],
		"techStack": "Android, iOS, Java, MySQL, AWS Elastic Beanstalk"
	}
]